'use client'
import logo from "../../img/logo.png";
import Image from "next/image";
import { useRef, useEffect } from "react";
import anime from "animejs";
import { Map } from '../Map/Map';
import { useState } from 'react';

import style from "./header.module.scss";

export const Header = () =>{
    const itemRef = useRef(null);
    const [openMap, setOpenMap] = useState(false);

    useEffect(() => {
        anime({
            targets: itemRef.current,
            translateY: [-100, 0],
            duration: 1000,
        });
    }, []);

    return(
        <>
        {openMap && <Map setOpenMap={setOpenMap}/>}
    <header className={style.header} ref={itemRef}>
        <div className={style.logo__all}>
            <Image src={logo} alt="МИДиС Вокруг"/>
            <span className={style.logo}>Международный Институт <br />
            Дизайна и Сервиса</span>
        </div>
        <div className={style.right}>
            <a href="/about"><span>О проекте</span></a>
            <a onClick={() => setOpenMap(!openMap)}><span>Карта</span></a>
            <div className={style.circle}>
                <div className={style.circle__age}>
                    <span>12+</span>
                </div>
                <div className={style.circle__age}>
                    <svg width="25" height="17" viewBox="0 0 25 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M24.9281 8.15575C24.8917 8.07181 24.0094 6.07538 22.0479 4.07469C19.4344 1.40887 16.1333 0 12.5 0C8.86666 0 5.56562 1.40887 2.95208 4.07469C0.990616 6.07538 0.104157 8.075 0.0718651 8.15575C0.0244829 8.26446 0 8.3821 0 8.50106C0 8.62003 0.0244829 8.73767 0.0718651 8.84637C0.108323 8.93031 0.990616 10.9257 2.95208 12.9264C5.56562 15.5911 8.86666 17 12.5 17C16.1333 17 19.4344 15.5911 22.0479 12.9264C24.0094 10.9257 24.8917 8.93031 24.9281 8.84637C24.9755 8.73767 25 8.62003 25 8.50106C25 8.3821 24.9755 8.26446 24.9281 8.15575ZM12.5 15.3C9.29375 15.3 6.4927 14.1111 4.17395 11.7672C3.22254 10.8021 2.4131 9.70164 1.77082 8.5C2.41293 7.29825 3.22238 6.19775 4.17395 5.23281C6.4927 2.88894 9.29375 1.7 12.5 1.7C15.7063 1.7 18.5073 2.88894 20.826 5.23281C21.7793 6.19752 22.5905 7.29801 23.2344 8.5C22.4833 9.93013 19.2115 15.3 12.5 15.3ZM12.5 3.4C11.5111 3.4 10.5444 3.69911 9.72215 4.25951C8.8999 4.8199 8.25904 5.61641 7.8806 6.54831C7.50216 7.48022 7.40314 8.50566 7.59607 9.49496C7.789 10.4843 8.2652 11.393 8.96446 12.1062C9.66373 12.8195 10.5546 13.3052 11.5245 13.502C12.4945 13.6988 13.4998 13.5978 14.4134 13.2118C15.3271 12.8258 16.1079 12.1721 16.6574 11.3334C17.2068 10.4947 17.5 9.50869 17.5 8.5C17.4986 7.14783 16.9714 5.85144 16.034 4.89531C15.0966 3.93918 13.8257 3.40141 12.5 3.4ZM12.5 11.9C11.8407 11.9 11.1963 11.7006 10.6481 11.327C10.0999 10.9534 9.67269 10.4224 9.4204 9.80112C9.16811 9.17985 9.1021 8.49623 9.23071 7.83669C9.35933 7.17716 9.6768 6.57134 10.143 6.09584C10.6091 5.62034 11.2031 5.29652 11.8497 5.16533C12.4963 5.03414 13.1665 5.10147 13.7756 5.35881C14.3847 5.61615 14.9053 6.05193 15.2716 6.61106C15.6378 7.17019 15.8333 7.82754 15.8333 8.5C15.8333 9.40174 15.4821 10.2665 14.857 10.9042C14.2319 11.5418 13.3841 11.9 12.5 11.9Z" fill="#1E1E1E" />
                    </svg>
                </div>
            </div>
            <span>+7 (351) 202-00-73</span>
        </div>
    </header>
    </>
    )
}